# stepik8.6_srednee_arifmeticheskoe

Найти среднее арифметическое элементов массива.

Входные данные:
Первая строка число 
N
,
(
N
>
0
)
N,(N>0) -- длина массива. Длина массива не более 100 элементов. Вторая строка 
N
N  натуральных чисел, записанных через пробел

Выходные данные: 
Одно вещественное число 
M
M -- среднее арифметическое элементов массива. Формат вывода -- два знака после запятой.

Подсказки: 
Среднее арифметическое равняется сумме всех элементов массива, делённой на количество элементов.


#include <stdio.h>
#include <stdlib.h>
#include <math.h>
 
int main(){
    
    int n;
    int i;
    double array[100];
    double sum = 0;
 
    scanf("%d",&n);

    for (i=0; i<n; i++)
    {
        scanf("%lf", &array[i]);
    }
  
    for (i=0; i<n; i++)
    {
      sum = sum + array[i];
    }

    printf ("%.2f", sum/n);
    
      
  
  return 0;
   
}
